
Функция ЭтоУНФ() Экспорт
	Возврат GPT_ОбщийМодульСервер.ЭтоУНФ();
КонецФункции

Функция ЭтоРозница() Экспорт
	Возврат GPT_ОбщийМодульСервер.ЭтоРозница();
КонецФункции

Функция GPT_СостояниеНастроек() Экспорт
	
	Настройки = GPT_ОбщийМодульСервер.НастройкаПоУмолчанию();
	
	ТокенЗаполнен = ЗначениеЗаполнено(Настройки.Токен);
	АдресСервераЗаполнен = ЗначениеЗаполнено(Настройки.АдресСервера);
	
	Возврат Новый Структура(
		"Готово,ТокенЗаполнен,АдресСервераЗаполнен",
		ТокенЗаполнен И АдресСервераЗаполнен,
		ТокенЗаполнен,
		АдресСервераЗаполнен
	);
	
КонецФункции
