
&НаКлиенте
Процедура ПроксиПоставляемыйНажатие(Элемент)
	АдресПроксиСервера = "https://38.114.101.23:8443";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Элементы.ПроксиПоставляемый.Заголовок);
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьСервер();
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьСервер()
	Настройки = GPT_ОбщийМодульСервер.НастройкаПоУмолчанию();
    НастройкиОбъект = Настройки.ПолучитьОбъект();
	НастройкиОбъект.Токен = Токен;
	НастройкиОбъект.НачалоЗапроса = НачалоЗапроса;  
	НастройкиОбъект.ИспользоватьПроксиСервер = ИспользоватьПроксиСервер;
	НастройкиОбъект.АдресПроксиСервера = АдресПроксиСервера; 
    НастройкиОбъект.ДополнительныеСвойстваХранилище = Новый ХранилищеЗначения(ДополнительныеСвойства.ВыгрузитьЗначения());
    НастройкиОбъект.ШаблонДопСвойств = ШаблонДопСвойств;
    НастройкиОбъект.МодельИИ = МодельИИ;
    НастройкиОбъект.ТокенAPI_proxy = ТокенAPI_proxy;
	НастройкиОбъект.Записать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Настройки = GPT_ОбщийМодульСервер.НастройкаПоУмолчанию();
	Токен = Настройки.Токен; 
	ТокенAPI_proxy = Настройки.ТокенAPI_proxy; 
	НачалоЗапроса = Настройки.НачалоЗапроса;
	ИспользоватьПроксиСервер = Настройки.ИспользоватьПроксиСервер;
	АдресПроксиСервера = Настройки.АдресПроксиСервера;
	МассивСвойств = Настройки.ДополнительныеСвойстваХранилище.Получить();
	Если ТипЗнч(МассивСвойств) = Тип("Массив") Тогда
		ДополнительныеСвойства.ЗагрузитьЗначения(МассивСвойств);
	КонецЕсли;
	
    ШаблонДопСвойств = Настройки.ШаблонДопСвойств;
	МодельИИ = Настройки.МодельИИ;
	
	Если НЕ ЗначениеЗаполнено(НачалоЗапроса) Тогда 
		НачалоЗапроса = "Рекламное описание товара";    
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(МодельИИ) Тогда 
		МодельИИ = "gpt-3.5-turbo";    
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ШаблонДопСвойств) Тогда 
		ШаблонДопСвойств = 	"Для товара ""{Наименование}"" определи значения следующих свойств: {Свойства}. Ответ верни строго в формате JSON, где ключи — это имена свойств, а значения — их значения. Если не знаешь значение — не включай свойство в JSON.";    
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНажатие(Элемент)
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(Элементы.Ссылка.Заголовок);
КонецПроцедуры
